OpenFOAM-11/tutorials/shockFluid/movingCone/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

for mapTime in 1e-05 2e-05
do
    runApplication -s $mapTime blockMesh -region meshToMesh_$mapTime
done

runApplication $(getApplication)

#------------------------------------------------------------------------------
